In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
 obj = Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [8]:
objTest = Series([4, 7, -5, 3,2], index=['d', 'b', 'a', 'c','c'])

In [9]:
objTest

d    4
b    7
a   -5
c    3
c    2
dtype: int64

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
 Index([d, b, a, c], dtype=object)

NameError: name 'Index' is not defined

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2['a']

-5

In [14]:
obj2['d'] = 6

In [15]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [16]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [17]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [18]:
 obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [20]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [21]:
'b' in obj2

True

In [22]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
obj3 = Series(sdata)

In [24]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [25]:
pd.isnull(obj3)

Ohio      False
Oregon    False
Texas     False
Utah      False
dtype: bool

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [27]:
frame = DataFrame(data)

In [28]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [30]:
 frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [31]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [38]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [39]:
 frame2['debt'] = 16.5

In [40]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [41]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [42]:
frame3 = DataFrame(pop)

In [43]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [44]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [52]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [46]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [47]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [48]:
obj3 = obj3.reindex(range(6), method='ffill')

In [49]:
obj3

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [56]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3 = obj3.reindex(range(6), method='bfill')

In [57]:
obj3

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [58]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [59]:
frame

               b         d         e
Utah   -0.340362  1.061874  0.018341
Ohio   -1.021562 -0.549519 -0.661235
Texas  -1.656470 -2.023820 -0.624498
Oregon -0.376807  0.248733  0.267549

In [60]:
np.abs(frame)

               b         d         e
Utah    0.340362  1.061874  0.018341
Ohio    1.021562  0.549519  0.661235
Texas   1.656470  2.023820  0.624498
Oregon  0.376807  0.248733  0.267549

In [61]:
 f = lambda x: x.max() - x.min()

In [62]:
frame.apply(f)

b    1.316108
d    3.085694
e    0.928784
dtype: float64

In [63]:
frame.sum()

b   -3.395201
d   -1.262733
e   -0.999843
dtype: float64

In [68]:
frame

               b         d         e
Utah   -0.340362  1.061874  0.018341
Ohio   -1.021562 -0.549519 -0.661235
Texas  -1.656470 -2.023820 -0.624498
Oregon -0.376807  0.248733  0.267549

In [67]:
frame.cumsum()

               b         d         e
Utah   -0.340362  1.061874  0.018341
Ohio   -1.361924  0.512354 -0.642894
Texas  -3.018394 -1.511466 -1.267392
Oregon -3.395201 -1.262733 -0.999843

In [69]:
frame.describe()

              b         d         e
count  4.000000  4.000000  4.000000
mean  -0.848800 -0.315683 -0.249961
std    0.622753  1.315122  0.465198
min   -1.656470 -2.023820 -0.661235
25%   -1.180289 -0.918095 -0.633682
50%   -0.699185 -0.150393 -0.303079
75%   -0.367696  0.452018  0.080643
max   -0.340362  1.061874  0.267549

In [70]:
 data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [71]:
data

a  1    0.467099
   2   -1.878014
   3    1.898547
b  1    1.892289
   2   -0.278717
   3   -0.574844
c  1   -0.579072
   2    0.768599
d  2   -0.429347
   3    1.696857
dtype: float64

In [72]:
data['a']

1    0.467099
2   -1.878014
3    1.898547
dtype: float64

In [74]:
data[:,2]

a   -1.878014
b   -0.278717
c    0.768599
d   -0.429347
dtype: float64